_orgs/2013-01-11-java_class_file.org
#+BEGIN_EXPORT html
---
layout: post
title: Java Class File Format
tags: [pl, java]
---
#+END_EXPORT


* Reference
1. http://en.wikipedia.org/wiki/Java_class_file
2. Java Specification Request-202 Chapter 4


* 文件头
#+BEGIN_SRC c
struct Class_File_Format {
   u4 magic_number;   
 
   u2 minor_version;   
   u2 major_version;   
 
   u2 constant_pool_count;   
 
   cp_info constant_pool[constant_pool_count - 1];
 
   u2 access_flags;
 
   u2 this_class;
   u2 super_class;
 
   u2 interfaces_count;   
 
   u2 interfaces[interfaces_count];
 
   u2 fields_count;   
   field_info fields[fields_count];
 
   u2 methods_count;
   method_info methods[methods_count];
 
   u2 attributes_count;   
   attribute_info attributes[attributes_count];
}
#+END_SRC
** magic\_number
   固定值 "0xcafebabe",但是在一个文件中看到的竟然是 *c38a c3be c2ba c2be* ,只好换一个文件看了.
#+begin_quote 
  A Java virtual machine implementation can support a class
ﬁle format of version v if and only if v lies in some contiguous
range Mi.0 ≤ v ≤Mj.m. Only Sun can specify what range of
versions a Java virtual machine implementation conforming to a
certain release level of the Java platform may support.
#+end_quote

** minor\_version and major\_version
   看到的两个都是 *0000 0032* ,

** constant\_pool\_count and constant\_pool
   constant\_pool 范围是 1~constant\_pool\_count-1,
   constant\_pool中的数据结构是变长的:
#+BEGIN_SRC c
cp_info {
  u1 tag;
  u2 info[];
}
#+END_SRC
   前面的tag表明类型.类型表格:

| Constant Type               | Value |
| CONSTANT\_Class             |     7 |
| CONSTANT\_Fieldref          |     9 |
| CONSTANT\_Methodref         |    10 |
| CONSTANT\_InterfaceMethorref |    11 |
| CONSTANT\_String            |     8 |
| CONSTANT\_Integer           |     3 |
| CONSTANT\_Float             |     4 |
| CONSTANT\_Long              |     5 |
| CONSTANT\_Double            |     6 |
| CONSTANT\_NameAndType       |    12 |
| CONSTANT\_Utf8              |     1 |
   后面跟随的是则是根据tag不同的结构.

*** CONSTANT\_Class
#+BEGIN_SRC c
CONSTANT_Class_info {
  u1 tag;
  u2 name_index;
}
#+END_SRC
    注意,这里代表的是cp_info的整个,所以也包括了tag.name\_index则代表的具体的名称的index,具体的名称同样也会在pool里面,指向的类型应该是 CONSTANT\_Utf8\_info 的类型.

    数组也是对象,表示形式比较特殊:
#+BEGIN_SRC java
int[][] => [[I
Thread[] => [Ljava/lang/Thread;
#+END_SRC
#+begin_quote 
An array type descriptor is valid only if it represents 255 or fewer dimensions.
#+end_quote
    这句是什么意思呢?最多只支持255维度?

*** CONSTANT\_*ref\_info
    *代表的是Field/Method/Interface,这几个结构一致.
#+BEGIN_SRC c
CONSTANT_*ref_info {
  u1 tag;
  u2 class_index;
  u2 name_and_type_index;
}
#+END_SRC
**** class\_index
     指向的内容,必须是 CONSTANT\_Class\_info 的结构. 而Methodref指向的不能是interface而只能是class.Interfaceref的只能是interface. Fieldref的则两种随便.

**** name\_and\_type\_index
     指向的则是 CONSTANT\_NameAndType\_info, 这个表述的是method/field的名字和描述[fn:1].field的必须是一个field descriptor. CONSTANT\_Methodref\_info的名字如果以 '<' 开始, 就需要是固定的 <init> ,表示 an instance initialization method, 其返回值必须是void.
***** field descriptor
#+BEGIN_SRC c
  A field descriptor represents the type of a class, instance, or local variable. It is a series of characters generated by the grammar
FieldDescriptor:
  FieldType
ComponentType:
  FieldType
FieldType:
  BaseType
ObjectType
  ArrayType
BaseType:
  *B*
  *C*
  *D*
  *F*
  *I*
  *J*
  *S*
  *Z*
ObjectType:
  L Classname;
ArrayType:
  [ComponentType
#+END_SRC

      /BaseType/的对应表格如下:
      | BaseType Character | Type      | Interpretation                        |
      | B                  | byte      | signed byte                           |
      | C                  | char      | Unicode character                     |
      | D                  | double    | double-precision floating-point value |
      | F                  | float     | single-precision floating-point value |
      | I                  | int       | integer                               |
      | J                  | long      | long integer                          |
      | L Classname;       | reference | an instance of class <classname>      |
      | S                  | short     | signed short                          |
      | Z                  | boolean   | true or false                         |
      | [                  | reference | one array dimension                   |

