_posts/2013-01-11-java_class_file.html
---
layout: post
title: Java Class File Format
tags: [pl, java]
---
<div id="outline-container-org585d25f" class="outline-2">
<h2 id="org585d25f"><span class="section-number-2">1.</span> Reference</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="http://en.wikipedia.org/wiki/Java_class_file">http://en.wikipedia.org/wiki/Java_class_file</a></li>
<li>Java Specification Request-202 Chapter 4</li>
</ol>
</div>
</div>
<div id="outline-container-orgb726ffa" class="outline-2">
<h2 id="orgb726ffa"><span class="section-number-2">2.</span> 文件头</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-c"><span class="org-keyword">struct</span> <span class="org-type">Class_File_Format</span> {
   <span class="org-type">u4</span> <span class="org-variable-name">magic_number</span>;   

   <span class="org-type">u2</span> <span class="org-variable-name">minor_version</span>;   
   <span class="org-type">u2</span> <span class="org-variable-name">major_version</span>;   

   <span class="org-type">u2</span> <span class="org-variable-name">constant_pool_count</span>;   

   <span class="org-type">cp_info</span> <span class="org-variable-name">constant_pool</span>[constant_pool_count - 1];

   <span class="org-type">u2</span> <span class="org-variable-name">access_flags</span>;

   <span class="org-type">u2</span> <span class="org-variable-name">this_class</span>;
   <span class="org-type">u2</span> <span class="org-variable-name">super_class</span>;

   <span class="org-type">u2</span> <span class="org-variable-name">interfaces_count</span>;   

   <span class="org-type">u2</span> <span class="org-variable-name">interfaces</span>[interfaces_count];

   <span class="org-type">u2</span> <span class="org-variable-name">fields_count</span>;   
   <span class="org-type">field_info</span> <span class="org-variable-name">fields</span>[fields_count];

   <span class="org-type">u2</span> <span class="org-variable-name">methods_count</span>;
   <span class="org-type">method_info</span> <span class="org-variable-name">methods</span>[methods_count];

   <span class="org-type">u2</span> <span class="org-variable-name">attributes_count</span>;   
   <span class="org-type">attribute_info</span> <span class="org-variable-name">attributes</span>[attributes_count];
}
</pre>
</div>
</div>
<div id="outline-container-orgf4f332a" class="outline-3">
<h3 id="orgf4f332a"><span class="section-number-3">2.1.</span> magic\<sub>number</sub></h3>
<div class="outline-text-3" id="text-2-1">
<p>
固定值 "0xcafebabe",但是在一个文件中看到的竟然是 <b>c38a c3be c2ba c2be</b> ,只好换一个文件看了.
</p>
<blockquote>
<p>
  A Java virtual machine implementation can support a class
ﬁle format of version v if and only if v lies in some contiguous
range Mi.0 ≤ v ≤Mj.m. Only Sun can specify what range of
versions a Java virtual machine implementation conforming to a
certain release level of the Java platform may support.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org4d122a1" class="outline-3">
<h3 id="org4d122a1"><span class="section-number-3">2.2.</span> minor\<sub>version</sub> and major\<sub>version</sub></h3>
<div class="outline-text-3" id="text-2-2">
<p>
看到的两个都是 <b>0000 0032</b> ,
</p>
</div>
</div>
<div id="outline-container-orgc70e1d7" class="outline-3">
<h3 id="orgc70e1d7"><span class="section-number-3">2.3.</span> constant\<sub>pool</sub>\<sub>count</sub> and constant\<sub>pool</sub></h3>
<div class="outline-text-3" id="text-2-3">
<p>
constant\<sub>pool</sub> 范围是 1~constant\<sub>pool</sub>\<sub>count</sub>-1,
constant\<sub>pool中的数据结构是变长的</sub>:
</p>
<div class="org-src-container">
<pre class="src src-c">cp_info {
  <span class="org-type">u1</span> <span class="org-variable-name">tag</span>;
  <span class="org-type">u2</span> <span class="org-variable-name">info</span>[];
}
</pre>
</div>
<p>
前面的tag表明类型.类型表格:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Constant Type</td>
<td class="org-right">Value</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>Class</sub></td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>Fieldref</sub></td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>Methodref</sub></td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>InterfaceMethorref</sub></td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>String</sub></td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>Integer</sub></td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>Float</sub></td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>Long</sub></td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>Double</sub></td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>NameAndType</sub></td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-left">CONSTANT\<sub>Utf8</sub></td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
<p>
后面跟随的是则是根据tag不同的结构.
</p>
</div>
<div id="outline-container-org82c4525" class="outline-4">
<h4 id="org82c4525"><span class="section-number-4">2.3.1.</span> CONSTANT\<sub>Class</sub></h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-c">CONSTANT_Class_info {
  <span class="org-type">u1</span> <span class="org-variable-name">tag</span>;
  <span class="org-type">u2</span> <span class="org-variable-name">name_index</span>;
}
</pre>
</div>
<p>
注意,这里代表的是cp<sub>info的整个,所以也包括了tag.name</sub>\<sub>index则代表的具体的名称的index,具体的名称同样也会在pool里面,指向的类型应该是</sub> CONSTANT\<sub>Utf8</sub>\<sub>info</sub> 的类型.
</p>

<p>
数组也是对象,表示形式比较特殊:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">int</span>[][] =&gt; [[I
Thread[] =&gt; [Ljava/lang/Thread;
</pre>
</div>
<blockquote>
<p>
An array type descriptor is valid only if it represents 255 or fewer dimensions.
</p>
</blockquote>
<p>
这句是什么意思呢?最多只支持255维度?
</p>
</div>
</div>
<div id="outline-container-orgad2844d" class="outline-4">
<h4 id="orgad2844d"><span class="section-number-4">2.3.2.</span> CONSTANT\<sub>*</sub>ref\<sub>info</sub></h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
*代表的是Field/Method/Interface,这几个结构一致.
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="org-type">CONSTANT_</span>*<span class="org-variable-name">ref_info</span> {
  <span class="org-type">u1</span> <span class="org-variable-name">tag</span>;
  <span class="org-type">u2</span> <span class="org-variable-name">class_index</span>;
  <span class="org-type">u2</span> <span class="org-variable-name">name_and_type_index</span>;
}
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="orgfdf72cb"></a>class\<sub>index</sub><br />
<div class="outline-text-5" id="text-2-3-2-1">
<p>
指向的内容,必须是 CONSTANT\<sub>Class</sub>\<sub>info</sub> 的结构. 而Methodref指向的不能是interface而只能是class.Interfaceref的只能是interface. Fieldref的则两种随便.
</p>
</div>
</li>
<li><a id="org52868f4"></a>name\<sub>and</sub>\<sub>type</sub>\<sub>index</sub><br />
<div class="outline-text-5" id="text-2-3-2-2">
<p>
指向的则是 CONSTANT\<sub>NameAndType</sub>\<sub>info</sub>, 这个表述的是method/field的名字和描述<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.field的必须是一个field descriptor. CONSTANT\<sub>Methodref</sub>\<sub>info的名字如果以</sub> '&lt;' 开始, 就需要是固定的 &lt;init&gt; ,表示 an instance initialization method, 其返回值必须是void.
</p>
</div>
<ol class="org-ol">
<li><a id="org8116dd7"></a>field descriptor<br />
<div class="outline-text-6" id="text-2-3-2-2-1">
<div class="org-src-container">
<pre class="src src-c">  A field descriptor represents the type of <span class="org-type">a</span> <span class="org-variable-name">class</span>, <span class="org-variable-name">instance</span>, <span class="org-variable-name">or</span> local variable. It is a series of characters generated by the grammar
FieldDescriptor:
  FieldType
ComponentType:
  FieldType
FieldType:
  BaseType
ObjectType
  ArrayType
BaseType:
  *B*
  *C*
  *D*
  *F*
  *I*
  *J*
  *S*
  *Z*
ObjectType:
  L Classname;
<span class="org-constant">ArrayType</span>:
  [ComponentType
</pre>
</div>

<p>
/BaseType/的对应表格如下:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">BaseType Character</td>
<td class="org-left">Type</td>
<td class="org-left">Interpretation</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">byte</td>
<td class="org-left">signed byte</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">char</td>
<td class="org-left">Unicode character</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">double</td>
<td class="org-left">double-precision floating-point value</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">float</td>
<td class="org-left">single-precision floating-point value</td>
</tr>

<tr>
<td class="org-left">I</td>
<td class="org-left">int</td>
<td class="org-left">integer</td>
</tr>

<tr>
<td class="org-left">J</td>
<td class="org-left">long</td>
<td class="org-left">long integer</td>
</tr>

<tr>
<td class="org-left">L Classname;</td>
<td class="org-left">reference</td>
<td class="org-left">an instance of class &lt;classname&gt;</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">short</td>
<td class="org-left">signed short</td>
</tr>

<tr>
<td class="org-left">Z</td>
<td class="org-left">boolean</td>
<td class="org-left">true or false</td>
</tr>

<tr>
<td class="org-left">[</td>
<td class="org-left">reference</td>
<td class="org-left">one array dimension</td>
</tr>
</tbody>
</table>
</div>
</li>
