_orgs/2013-01-11-java_class_file.org
***** 剩下的都要是method descriptor
      直接引用吧:
#+BEGIN_SRC c 
MethodDescriptor:
  ( ParameterDescriptor* ) ReturnDescriptor
A parameter descriptor represents a parameter passed to a method:
ParameterDescriptor:
  FieldType
A return descriptor represents the type of the value returned from a method. It is a
series of characters generated by the grammar:

ReturnDescriptor:
  FieldType
  VoidDescriptor

VoidDescriptor:
  *V*
#+END_SRC
这里,parameters的length要少于等于255.具体的length计算要包括所有的parameters的和, *long* 或者 *double* 代表两个单元,而其他的都代表一个单元[fn:2].还要注意,实体类和接口方法调用的时候,this这个参数也是要算进去的[fn:3].

#+begin_quote 
  Object mymethod(int i, double d, Thread t)
=> (IDLjava/lang/Thread;)Ljava/lang/Object;
#+end_quote

*** CONSTANT\_String\_info
#+BEGIN_SRC c
CONSTANT_String_info {
  u1 tag;
  u2 string_index;
}
#+END_SRC

比较简单,index指向的必须是 CONSTANT\_Utf8\_info

*** CONSTANT\_Integer\_info and CONSTANT\_Float\_info
#+BEGIN_SRC c
CONSTANT_*_info {
  u1 tag;
  u4 bytes;
}
#+END_SRC

bytes中保存是常量的值,其中float的是IEEE 754 floating-point single format.都是big-endian.
表示float的value,首先转换为int,直接引用:
#+begin_quote 
+ If bits is 0x7f800000, the float value will be positive inﬁnity.
+ If bits is 0xff800000, the float value will be negative inﬁnity.
+ If bits is in the range 0x7f800001 through 0x7fffffff or in the range 0xff800001 through 0xffffffff, the float value will be NaN.
+ In all other cases, let s, e, and m be three values that might be computed from bits:
  + int s = ((bits >> 31) == 0) ? 1 : -1;
  + int e = ((bits >> 23) & 0xff);
  + int m = (e == 0) ?
       (bits & 0x7fffff) << 1 :
       (bits & 0x7fffff) | 0x800000;
  + Then the float value equals the result of the mathematical expression . s * m* 2^(e-150)
#+end_quote

*** CONSTANT\_Long\_info and CONSTANT\_Double\_info
#+BEGIN_SRC c
CONSTANT_*_info {
  u1 tag;
  u4 high_bytes;
  u4 low_bytes;
}
#+END_SRC

这里计算index有个特殊情况,这两个结构一次占用两个位置.
#+BEGIN_SRC c
All 8-byte constants take up two entries in the constant_pool table of the class
ﬁle. If a CONSTANT_Long_info or CONSTANT_Double_info structure is the item
in the constant_pool table at index n, then the next usable item in the pool is
located at index n +2. The constant_pool index n +1 must be valid but is
considered unusable.
#+END_SRC
基本类似上面的integer和float,只不过长度加多了.有关double的确定也是一样:
#+begin_quote 
+ If bits is 0x7ff0000000000000L, the double value will be positive inﬁnity.
+ If bits is 0xfff0000000000000L, the double value will be negative inﬁnity.
+ If bits is in the range 0x7ff0000000000001L through 0x7fffffffffffffffL or in the range 0xfff0000000000001L through 0xffffffffffffffffL, the double value will be NaN.
+ In all other cases, let s, e, and m be three values that might be computed from bits:
  + int s = ((bits >> 63) == 0) ? 1 : -1;
  + int e = (int)((bits >> 52) & 0x7ffL);
  + long m = (e == 0) ?
        (bits & 0xfffffffffffffL) << 1 :
        (bits & 0xfffffffffffffL) | 0x10000000000000L;
  + Then the ﬂoating-point value equals the double value of the mathematical expression s*m*2^(e-1075)

#+end_quote

*** CONSTANT\_NameAndType\_info
#+BEGIN_SRC c
CONSTANT_NameAndType_info {
  u1 tag;
  u2 name_index;
  u2 descriptor_index;
}
#+END_SRC
index指向的都是 CONSTANT\_Utf8\_info,一个是名字,一个是 descriptor.
*** CONSTANT\_Utf8\_info
#+begin_quote 
The CONSTANT\_Utf8\_info structure is used to represent constant string values.String content is encoded in /modified/ UTF-8.
#+end_quote
和标准的UTF-8有小不同:
#+begin_quote 
There are two differences between this format and the “standard” UTF-8 format.
First, the null character (char)0 is encoded using the 2-byte format rather than
the 1-byte format, so that modiﬁed UTF-8 strings never have embedded nulls.
Second, only the 1-byte, 2-byte, and 3-byte formats of standard UTF-8 are used.
The Java VM does not recognize the four-byte format of standard UTF-8; it uses
its own two-times-three-byte format instead.
#+end_quote
结构如下:
#+BEGIN_SRC c
CONSTANT_Utf8_info {
  u1 tag;
  u2 length;
  u1 bytes[length];
}
#+END_SRC
没有可以多废话,很明显,限制条件是,不能是0 和 range(0xf0, 0xff)[fn:4]

** 扯远了,要回来了,access\_flags
   列表就可以,如下:
   | Flag Name      |  Value | Intepretation                                                                     |
   | ACC\_PUBLIC    | 0x0001 | Declared public; may be accessed from outside its package.                        |
   | ACC\_FINAL     | 0x0010 | Declared final; no subclasses allowed.                                            |
   | ACC\_SUPER     | 0x0020 | Treat superclass methods specially when invoked by the invokespecial instruction. |
   | ACC\_INTERFACE | 0x0200 | Is an interface, not a class.                                                     |
   | ACC\_ABSTRACT  | 0x0400 | Declared abstract; must not be instantiated.                                      |
   | ACC\_SYNTHETIC | 0x1000 | Declared synthetic; Not present in the source code.                               |
   | ACC\_ANNOTATION | 0x2000 | Declared as an annotation type.                                                   |
   | ACC\_ENUM      | 0x4000 | Declared as an enum type.                                                         | 
  看位置就可以知道,几个flag可以同时存在,interface必须也要有abstract,annotation有了就要有interface.

  super的用来向上兼容,新编译器都应该直接设置.应该是为了 invokespecial 这个指令.

** this\_index
   指向pool里面的CONSTANT_Class_info类型.
** super\_class
   除了object都要有,这是废话.不能是final的,这也是废话.interface的都要指向object,这个算不是废话.
