_posts/2013-01-11-java_class_file.html
<li><a id="orgaf44de9"></a>剩下的都要是method descriptor<br />
<div class="outline-text-6" id="text-2-3-2-2-2">
<p>
直接引用吧:
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="org-constant">MethodDescriptor</span>:
  ( <span class="org-type">ParameterDescriptor</span>* ) ReturnDescriptor
A parameter descriptor represents a parameter passed to a <span class="org-type">method</span>:
ParameterDescriptor:
  FieldType
A <span class="org-keyword">return</span> descriptor represents the type of the value returned from a method. It is a
series of characters generated by the grammar:

ReturnDescriptor:
  FieldType
  VoidDescriptor

VoidDescriptor:
  *V*
</pre>
</div>
<p>
这里,parameters的length要少于等于255.具体的length计算要包括所有的parameters的和, <b>long</b> 或者 <b>double</b> 代表两个单元,而其他的都代表一个单元<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.还要注意,实体类和接口方法调用的时候,this这个参数也是要算进去的<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.
</p>

<blockquote>
<p>
  Object mymethod(int i, double d, Thread t)
=&gt; (IDLjava/lang/Thread;)Ljava/lang/Object;
</p>
</blockquote>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgedac846" class="outline-4">
<h4 id="orgedac846"><span class="section-number-4">2.3.3.</span> CONSTANT\<sub>String</sub>\<sub>info</sub></h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">
<pre class="src src-c">CONSTANT_String_info {
  <span class="org-type">u1</span> <span class="org-variable-name">tag</span>;
  <span class="org-type">u2</span> <span class="org-variable-name">string_index</span>;
}
</pre>
</div>

<p>
比较简单,index指向的必须是 CONSTANT\<sub>Utf8</sub>\<sub>info</sub>
</p>
</div>
</div>
<div id="outline-container-org0389641" class="outline-4">
<h4 id="org0389641"><span class="section-number-4">2.3.4.</span> CONSTANT\<sub>Integer</sub>\<sub>info</sub> and CONSTANT\<sub>Float</sub>\<sub>info</sub></h4>
<div class="outline-text-4" id="text-2-3-4">
<div class="org-src-container">
<pre class="src src-c"><span class="org-type">CONSTANT_</span>*<span class="org-variable-name">_info</span> {
  <span class="org-type">u1</span> <span class="org-variable-name">tag</span>;
  <span class="org-type">u4</span> <span class="org-variable-name">bytes</span>;
}
</pre>
</div>

<p>
bytes中保存是常量的值,其中float的是IEEE 754 floating-point single format.都是big-endian.
表示float的value,首先转换为int,直接引用:
</p>
<blockquote>
<ul class="org-ul">
<li>If bits is 0x7f800000, the float value will be positive inﬁnity.</li>
<li>If bits is 0xff800000, the float value will be negative inﬁnity.</li>
<li>If bits is in the range 0x7f800001 through 0x7fffffff or in the range 0xff800001 through 0xffffffff, the float value will be NaN.</li>
<li>In all other cases, let s, e, and m be three values that might be computed from bits:
<ul class="org-ul">
<li>int s = ((bits &gt;&gt; 31) == 0) ? 1 : -1;</li>
<li>int e = ((bits &gt;&gt; 23) &amp; 0xff);</li>
<li>int m = (e == 0) ?
(bits &amp; 0x7fffff) &lt;&lt; 1 :
(bits &amp; 0x7fffff) | 0x800000;</li>
<li>Then the float value equals the result of the mathematical expression . s * m* 2<sup>(e-150)</sup></li>
</ul></li>
</ul>
</blockquote>
</div>
</div>
<div id="outline-container-orge9cd801" class="outline-4">
<h4 id="orge9cd801"><span class="section-number-4">2.3.5.</span> CONSTANT\<sub>Long</sub>\<sub>info</sub> and CONSTANT\<sub>Double</sub>\<sub>info</sub></h4>
<div class="outline-text-4" id="text-2-3-5">
<div class="org-src-container">
<pre class="src src-c"><span class="org-type">CONSTANT_</span>*<span class="org-variable-name">_info</span> {
  <span class="org-type">u1</span> <span class="org-variable-name">tag</span>;
  <span class="org-type">u4</span> <span class="org-variable-name">high_bytes</span>;
  <span class="org-type">u4</span> <span class="org-variable-name">low_bytes</span>;
}
</pre>
</div>

<p>
这里计算index有个特殊情况,这两个结构一次占用两个位置.
</p>
<div class="org-src-container">
<pre class="src src-c">All 8-byte constants take up two entries in the constant_pool table of the class
&#64257;le. If a CONSTANT_Long_info or CONSTANT_Double_info structure is the item
in the constant_pool table at index n, then the next usable item in the pool is
located at index n +2. The constant_pool index n +1 must be valid but is
considered unusable.
</pre>
</div>
<p>
基本类似上面的integer和float,只不过长度加多了.有关double的确定也是一样:
</p>
<blockquote>
<ul class="org-ul">
<li>If bits is 0x7ff0000000000000L, the double value will be positive inﬁnity.</li>
<li>If bits is 0xfff0000000000000L, the double value will be negative inﬁnity.</li>
<li>If bits is in the range 0x7ff0000000000001L through 0x7fffffffffffffffL or in the range 0xfff0000000000001L through 0xffffffffffffffffL, the double value will be NaN.</li>
<li>In all other cases, let s, e, and m be three values that might be computed from bits:
<ul class="org-ul">
<li>int s = ((bits &gt;&gt; 63) == 0) ? 1 : -1;</li>
<li>int e = (int)((bits &gt;&gt; 52) &amp; 0x7ffL);</li>
<li>long m = (e == 0) ?
(bits &amp; 0xfffffffffffffL) &lt;&lt; 1 :
(bits &amp; 0xfffffffffffffL) | 0x10000000000000L;</li>
<li>Then the ﬂoating-point value equals the double value of the mathematical expression s*m*2<sup>(e-1075)</sup></li>
</ul></li>
</ul>
</blockquote>
</div>
</div>
<div id="outline-container-orgbc38d5f" class="outline-4">
<h4 id="orgbc38d5f"><span class="section-number-4">2.3.6.</span> CONSTANT\<sub>NameAndType</sub>\<sub>info</sub></h4>
<div class="outline-text-4" id="text-2-3-6">
<div class="org-src-container">
<pre class="src src-c">CONSTANT_NameAndType_info {
  <span class="org-type">u1</span> <span class="org-variable-name">tag</span>;
  <span class="org-type">u2</span> <span class="org-variable-name">name_index</span>;
  <span class="org-type">u2</span> <span class="org-variable-name">descriptor_index</span>;
}
</pre>
</div>
<p>
index指向的都是 CONSTANT\<sub>Utf8</sub>\<sub>info,一个是名字,一个是</sub> descriptor.
</p>
</div>
</div>
<div id="outline-container-org7f168ad" class="outline-4">
<h4 id="org7f168ad"><span class="section-number-4">2.3.7.</span> CONSTANT\<sub>Utf8</sub>\<sub>info</sub></h4>
<div class="outline-text-4" id="text-2-3-7">
<blockquote>
<p>
The CONSTANT\<sub>Utf8</sub>\<sub>info</sub> structure is used to represent constant string values.String content is encoded in <i>modified</i> UTF-8.
</p>
</blockquote>
<p>
和标准的UTF-8有小不同:
</p>
<blockquote>
<p>
There are two differences between this format and the “standard” UTF-8 format.
First, the null character (char)0 is encoded using the 2-byte format rather than
the 1-byte format, so that modiﬁed UTF-8 strings never have embedded nulls.
Second, only the 1-byte, 2-byte, and 3-byte formats of standard UTF-8 are used.
The Java VM does not recognize the four-byte format of standard UTF-8; it uses
its own two-times-three-byte format instead.
</p>
</blockquote>
<p>
结构如下:
</p>
<div class="org-src-container">
<pre class="src src-c">CONSTANT_Utf8_info {
  <span class="org-type">u1</span> <span class="org-variable-name">tag</span>;
  <span class="org-type">u2</span> <span class="org-variable-name">length</span>;
  <span class="org-type">u1</span> <span class="org-variable-name">bytes</span>[length];
}
</pre>
</div>
<p>
没有可以多废话,很明显,限制条件是,不能是0 和 range(0xf0, 0xff)<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>
</p>
</div>
</div>
</div>
<div id="outline-container-org15de102" class="outline-3">
<h3 id="org15de102"><span class="section-number-3">2.4.</span> 扯远了,要回来了,access\<sub>flags</sub></h3>
<div class="outline-text-3" id="text-2-4">
<p>
列表就可以,如下:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Flag Name</td>
<td class="org-right">Value</td>
<td class="org-left">Intepretation</td>
</tr>

<tr>
<td class="org-left">ACC\<sub>PUBLIC</sub></td>
<td class="org-right">0x0001</td>
<td class="org-left">Declared public; may be accessed from outside its package.</td>
</tr>

<tr>
<td class="org-left">ACC\<sub>FINAL</sub></td>
<td class="org-right">0x0010</td>
<td class="org-left">Declared final; no subclasses allowed.</td>
</tr>

<tr>
<td class="org-left">ACC\<sub>SUPER</sub></td>
<td class="org-right">0x0020</td>
<td class="org-left">Treat superclass methods specially when invoked by the invokespecial instruction.</td>
</tr>

<tr>
<td class="org-left">ACC\<sub>INTERFACE</sub></td>
<td class="org-right">0x0200</td>
<td class="org-left">Is an interface, not a class.</td>
</tr>

<tr>
<td class="org-left">ACC\<sub>ABSTRACT</sub></td>
<td class="org-right">0x0400</td>
<td class="org-left">Declared abstract; must not be instantiated.</td>
</tr>

<tr>
<td class="org-left">ACC\<sub>SYNTHETIC</sub></td>
<td class="org-right">0x1000</td>
<td class="org-left">Declared synthetic; Not present in the source code.</td>
</tr>

<tr>
<td class="org-left">ACC\<sub>ANNOTATION</sub></td>
<td class="org-right">0x2000</td>
<td class="org-left">Declared as an annotation type.</td>
</tr>

<tr>
<td class="org-left">ACC\<sub>ENUM</sub></td>
<td class="org-right">0x4000</td>
<td class="org-left">Declared as an enum type.</td>
</tr>
</tbody>
</table>
<p>
看位置就可以知道,几个flag可以同时存在,interface必须也要有abstract,annotation有了就要有interface.
</p>

<p>
super的用来向上兼容,新编译器都应该直接设置.应该是为了 invokespecial 这个指令.
</p>
</div>
</div>
<div id="outline-container-org1f8ed54" class="outline-3">
<h3 id="org1f8ed54"><span class="section-number-3">2.5.</span> this\<sub>index</sub></h3>
<div class="outline-text-3" id="text-2-5">
<p>
指向pool里面的CONSTANT<sub>Class</sub><sub>info类型</sub>.
</p>
</div>
</div>
<div id="outline-container-org75cd50d" class="outline-3">
<h3 id="org75cd50d"><span class="section-number-3">2.6.</span> super\<sub>class</sub></h3>
<div class="outline-text-3" id="text-2-6">
<p>
除了object都要有,这是废话.不能是final的,这也是废话.interface的都要指向object,这个算不是废话.
</p>
</div>
</div>
