_orgs/2013-01-11-java_class_file.org
** interfaces\_count and interfaces[]
   顺序是代码中的从左到右,或者是direct superinterface.指向的,自然是pool里面的东西.
** fields\_count and fields[]
   其中的field是field\_info结构
*** field\_info
#+BEGIN_SRC c
field_info {
 u2 access_flags;
 u2 name_index;
 u2 descriptor_index;
 u2 attributes_count;
 attribute_info attributes[attributes_count];
}
#+END_SRC
主要就是 attribute\_info ,结构:
#+BEGIN_SRC c
attribute_info {
  u2 attribute_name_index;
  u4 attribute_length;
  u1 info[attribute_length];
}
#+END_SRC
有predefined的,SourceFile,ConstantValue,Code,StackMapTable,Exceptions,InnerClasses,EnclosingMethod, Synthetic, Signature,
LineNumberTable, LocalVariableTable and Deprecated...后面太多了,不看了.
** method\_count and methods[]
   methods里面存了所有的方法,除了superclass和superinterface的方法.
** attributes\_count and attributes[]

* Footnotes

[fn:1] 描述是什么东西?Doc?

[fn:2] 为什么double和long有特殊呢?

[fn:3] 原来Java也是要传this的......

[fn:4] 这个区间到底是开是闭没说,估计应该是闭区间.

    

