_posts/2013-01-11-java_class_file.html
<div id="outline-container-org086b0d4" class="outline-3">
<h3 id="org086b0d4"><span class="section-number-3">2.7.</span> interfaces\<sub>count</sub> and interfaces[]</h3>
<div class="outline-text-3" id="text-2-7">
<p>
顺序是代码中的从左到右,或者是direct superinterface.指向的,自然是pool里面的东西.
</p>
</div>
</div>
<div id="outline-container-org640b1a8" class="outline-3">
<h3 id="org640b1a8"><span class="section-number-3">2.8.</span> fields\<sub>count</sub> and fields[]</h3>
<div class="outline-text-3" id="text-2-8">
<p>
其中的field是field\<sub>info结构</sub>
</p>
</div>
<div id="outline-container-orgc2f4a99" class="outline-4">
<h4 id="orgc2f4a99"><span class="section-number-4">2.8.1.</span> field\<sub>info</sub></h4>
<div class="outline-text-4" id="text-2-8-1">
<div class="org-src-container">
<pre class="src src-c">field_info {
 <span class="org-type">u2</span> <span class="org-variable-name">access_flags</span>;
 <span class="org-type">u2</span> <span class="org-variable-name">name_index</span>;
 <span class="org-type">u2</span> <span class="org-variable-name">descriptor_index</span>;
 <span class="org-type">u2</span> <span class="org-variable-name">attributes_count</span>;
 <span class="org-type">attribute_info</span> <span class="org-variable-name">attributes</span>[attributes_count];
}
</pre>
</div>
<p>
主要就是 attribute\<sub>info</sub> ,结构:
</p>
<div class="org-src-container">
<pre class="src src-c">attribute_info {
  <span class="org-type">u2</span> <span class="org-variable-name">attribute_name_index</span>;
  <span class="org-type">u4</span> <span class="org-variable-name">attribute_length</span>;
  <span class="org-type">u1</span> <span class="org-variable-name">info</span>[attribute_length];
}
</pre>
</div>
<p>
有predefined的,SourceFile,ConstantValue,Code,StackMapTable,Exceptions,InnerClasses,EnclosingMethod, Synthetic, Signature,
LineNumberTable, LocalVariableTable and Deprecated&#x2026;后面太多了,不看了.
</p>
</div>
</div>
</div>
<div id="outline-container-orgae57d12" class="outline-3">
<h3 id="orgae57d12"><span class="section-number-3">2.9.</span> method\<sub>count</sub> and methods[]</h3>
<div class="outline-text-3" id="text-2-9">
<p>
methods里面存了所有的方法,除了superclass和superinterface的方法.
</p>
</div>
</div>
<div id="outline-container-org34ae3c9" class="outline-3">
<h3 id="org34ae3c9"><span class="section-number-3">2.10.</span> attributes\<sub>count</sub> and attributes[]</h3>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
描述是什么东西?Doc?
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
为什么double和long有特殊呢?
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
原来Java也是要传this的&#x2026;&#x2026;
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
这个区间到底是开是闭没说,估计应该是闭区间.
</p></div></div>


</div>
</div>
